In [1]:
import pandas as pd
import sqlalchemy #criar conexão sql

# Instalar a biblioteca pymysql
'''pip install pymysql'''

In [2]:
#engine de conexão
engine = sqlalchemy.create_engine('mysql+pymysql://root:user@localhost:3306/exemploDB')

In [3]:
#método read_sql_table
df = pd.read_sql_table('cliente', engine) #Tabela cliente criada no banco exemplo db no  MySql

In [4]:
df

   COD_CLI   NOME SOBRENOME
0        1  André  Ferreira
1        2  Luisa  Ferreira
2        3  Sofia  Ferreira

In [5]:
#criando um df com apenas a coluna nome da tabela cliente do banco exemplodb do mysql
df = pd.read_sql_table('cliente', engine, columns=['NOME', 'SOBRENOME'])
df

    NOME SOBRENOME
0  André  Ferreira
1  Luisa  Ferreira
2  Sofia  Ferreira

In [6]:
#criando uma consulta 
df = pd.read_sql_query('select * from cliente', engine)
df

   COD_CLI   NOME SOBRENOME
0        1  André  Ferreira
1        2  Luisa  Ferreira
2        3  Sofia  Ferreira

In [7]:
#criando um index_col
df = pd.read_sql_query('SELECT * FROM cliente', engine, index_col='COD_CLI')
df

          NOME SOBRENOME
COD_CLI
1        André  Ferreira
2        Luisa  Ferreira
3        Sofia  Ferreira

In [8]:
#criando uma busca por nome
query = 'SELECT  nome FROM  cliente WHERE nome = %s'
df = pd.read_sql_query(query, engine, params=['André'])
df

    nome
0  André